### Import required dependencies

In [8]:
import pandas as pd
import os

## Deliverable 1: Collect the Data

To collect the data that youâ€™ll need, complete the following steps:

1. Using the Pandas `read_csv` function and the `os` module, import the data from the `new_full_student_data.csv` file, and create a DataFrame called student_df. 

2. Use the head function to confirm that Pandas properly imported the data.

In [9]:
# Create the path and import the data
full_student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [10]:
# Verify that the data was properly imported
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

## Deliverable 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
1. Check for and remove all rows with `NaN`, or missing, values in the student DataFrame. 

2. Check for and remove all duplicate rows in the student DataFrame.

3. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.

4. Check data types using the `dtypes` property.

5. Remove the "th" suffix from every value in the grade column using `str` and `replace`.

6. Change the grade colum to the `int` type and verify column types.

7. Use the head (and/or the tail) function to preview the DataFrame.

In [11]:
# Check for null values
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [12]:
# Drop rows with null values and verify removal
drop_nulls = student_df.dropna()

drop_nulls.isnull().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [13]:
# Check for duplicated rows
duplicates = student_df.duplicated().sum()

duplicates

2168

In [14]:
# Drop duplicated rows and verify removal
drop_duplicates = student_df.drop_duplicates()

drop_duplicates.duplicated().sum()

0

In [15]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [16]:
# Examine the grade column to understand why it is not an int
student_df['grade']

0         9th
1         9th
2         9th
3         9th
4        11th
         ...
19509    12th
19510     9th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 19514, dtype: object

In [17]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace('th','')
student_df['grade']

0         9
1         9
2         9
3         9
4        11
         ..
19509    12
19510     9
19511    11
19512    11
19513    12
Name: grade, Length: 19514, dtype: object

In [18]:
# Change the grade column to the int type and verify column types
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

## Deliverable 3: Summarize the Data

Describe the data using summary statistics on the data as a whole and on individual columns.

1. Generate the summary statistics for each DataFrame by using the `describe` function.

2. Display the mean math score using the `mean` function. 

2. Store the minimum reading score as `min_reading_score`.

In [19]:
# Display summary statistics for the DataFrame
summary = student_df.describe()
summary

         student_id         grade  reading_score    math_score  school_budget
count  1.951400e+04  19514.000000   17546.000000  18532.000000   19514.000000
mean   6.975630e+07     10.353849      72.407854     64.628972  893738.174080
std    3.459615e+07      1.096990      15.206922     15.800076   53975.504589
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.962676e+07      9.000000      62.300000     54.400000  846745.000000
50%    6.972680e+07     10.000000      73.800000     65.200000  893368.000000
75%    9.949126e+07     11.000000      84.000000     75.900000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [20]:
# Display the mean math score using the mean function
mean_math = student_df["math_score"].mean()


mean_math

64.62897150874173

In [21]:
# Store the minimum reading score as min_reading_score
min_read = student_df["reading_score"].min()
min_read

10.5

## Deliverable 4: Drill Down into the Data

Drill down to specific rows, columns, and subsets of the data.

To drill down into the data, complete the following steps:

1. Use `loc` to display the grade column.

2. Use `iloc` to display the first 3 rows and columns 3, 4, and 5.

3. Show the rows for grade nine using `loc`.

4. Store the row with the minimum overall reading score as `min_reading_row` using `loc` and the `min_reading_score` found in Deliverable 3.

5. Find the reading scores for the school and grade from the output of step three using `loc` with multiple conditional statements.

6. Using conditional statements and `loc` or `iloc`, find the mean reading score for all students in grades 11 and 12 combined.

In [22]:
# Use loc to display the grade column
grade_only = student_df.loc[:,["grade"]]
grade_only

       grade
0          9
1          9
2          9
3          9
4         11
...      ...
19509     12
19510      9
19511     11
19512     11
19513     12

[19514 rows x 1 columns]

In [23]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
more_loc = student_df.loc[0:2,["school_name", "reading_score","math_score"]]
more_loc

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [24]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
nine_only_loc = student_df.loc[(student_df["grade"]==9)]
nine_only_loc.describe()

#Not matching, not sure why

         student_id   grade  reading_score   math_score  school_budget
count  5.446000e+03  5446.0    4904.000000  5165.000000    5446.000000
mean   6.977851e+07     9.0      69.302386    66.565712  898443.699780
std    3.468710e+07     0.0      15.351600    16.680048   54681.181681
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.981333e+07     9.0      59.000000    56.000000  846745.000000
50%    7.010611e+07     9.0      70.200000    67.700000  893368.000000
75%    9.948178e+07     9.0      80.600000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [25]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_score = student_df.loc[(student_df["reading_score"]==min_read)]
min_reading_score

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [28]:
# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
dixon_high = student_df.loc[(student_df["school_name"] == "Dixon High School") &  (student_df["grade"] == 10), ["school_name","reading_score"]]
dixon_high

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[733 rows x 2 columns]

In [29]:
# Find the mean reading score for all students in grades 11 and 12 combined.
get_grades = student_df.loc[(student_df["grade"]>10, "reading_score")]
get_grades.mean()

74.97025205553284

## Deliverable 5: Make Comparisons Between District and Charter Schools

Compare district vs charter schools for budget, size, and scores.

Make comparisons within your data by completing the following steps:

1. Using the `groupby` and `mean` functions, look at the average reading and math scores per school type.

1. Using the `groupby` and `count` functions, find the total number of students at each school.

2. Using the `groupby` and `mean` functions, find the average budget per grade for each school type.

In [30]:
# Use groupby and mean to find the average reading and math scores for each school type.
avg_school_budget = student_df.groupby(by="school_type").mean()
avg_school_budget.loc[:,["school_budget"]]

             school_budget
school_type
Charter      872614.677230
Public       911217.778704

In [33]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.

total_students = student_df.groupby("school_name").count()
total_students.loc[:,["student_id"]].sort_values("student_id", ascending=[False])

                        student_id
school_name
Montgomery High School        2690
Green High School             2602
Dixon High School             2074
Wagner High School            2018
Silva High School             1452
Woods High School             1373
Sullivan High School          1273
Turner High School            1122
Fisher High School            1060
Bowers High School            1051
Richard High School            718
Campos High School             717
Odonnell High School           612
Campbell High School           539
Chang High School              213

In [145]:
#Find the average math score by grade for each school type by using the groupby and mean functions, as the following image shows:
grade_by_school_type = student_df.groupby(["school_type","grade"]).mean().round(0)
grade_by_school_type["math_score"]

school_type  grade
Charter      9        70.0
             10       66.0
             11       68.0
             12       60.0
Public       9        64.0
             10       64.0
             11       59.0
             12       64.0
Name: math_score, dtype: float64

# Deliverable 6: Summarize Your Findings
In the cell below, write a few sentences to describe any discoveries you made while performing your analysis along with any additional analysis you believe would be worthwhile.

I think when you are dealing with data from outside sources you are going to have to wondering the integrity of the data. 

From the start we find there are over 2000 duplicates in our data set which is a little worrisome. That said, once we removed the duplicates we were able to make some discoveries. 

Even though the analysis only asked to evaluate grade 9, the describe function gave up insights as to the performace of the grade. We find that the test scores in the 75% quadrants also had higher scholl budget. You could attempt to build an arguement that schools with better funding have better testing results. 

We also know that charter schools average math score is better across all grade than public schools. A case could then also be made that there should be more charter schools.